echo '---\ntitle: "📚 ｜ 🐧 ｜ 仮想化って？"\n---' >                                                                                              0-tutorial-1-virtualization.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ Docker って？"\n---' >                                                                                             0-tutorial-2-docker.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ このワークでなにするの？"\n---' >                                                                                  0-tutorial-3-work.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ コンテナって？"\n---' >                                                                                            1-container-1-overview.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ Ubuntu コンテナで PHP が動くようにしよう"\n---' >                                                                  1-container-2-php.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ MySQL データベースを数分で用意しよう"\n---' >                                                                      1-container-3-mysql.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ Mail サーバを数分で用意しよう"\n---' >                                                                             1-container-4-mail.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ コンテナ一覧ってどうやって確認するの？"\n---' >                                                                    1-container-5-list.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ コンテナってどうやって終了するの？"\n---' >                                                                        1-container-6-stop.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ コンテナを終了するとどうなるの？"\n---' >                                                                          1-container-7-dispose.md
echo '---\ntitle: "📚 ｜ 📝 ｜ コンテナのまとめ"\n---' >                                                                                          1-container-8-summary.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ イメージって？"\n---' >                                                                                            2-image-1-overview.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ PHP イメージを作ってコンテナ起動を早くしよう"\n---' >                                                              2-image-2-php.md
echo '---\ntitle: "🖥️ ｜ 🐧 ｜ PHP コンテナの MPA の設定をしよう"\n---' >                                                                         2-image-3-mpa.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ MySQL サーバの設定をしよう"\n---' >                                                                                2-image-4-mysql.md
echo '---\ntitle: "📚 ｜ 🐧 ｜ パッケージ管理コマンドって？"\n---' >                                                                              2-image-5-package.md
echo '---\ntitle: "📚 ｜ 🐧 ｜ OS やパッケージ管理コマンドをすぐ把握するには？"\n---' >                                                           2-image-6-os.md
echo '---\ntitle: "📚 ｜ 📝 ｜ イメージのまとめ"\n---' >                                                                                          2-image-7-summary.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ ポートって？"\n---' >                                                                                              3-port-1-overview.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ PHP コンテナにブラウザアクセスできるようにしよう"\n---' >                                                          3-port-2-php.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ Mail コンテナにブラウザアクセスできるようにしよう"\n---' >                                                         3-port-3-mail.md
echo '---\ntitle: "📚 ｜ 📝 ｜ ポートのまとめ"\n---' >                                                                                            3-port-4-summary.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ エラーって？"\n---' >                                                                                              4-error-1-overview.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ ビルドのエラーを調べられるようになろう"\n---' >                                                                    4-error-2-build.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ コンテナ起動のエラーを調べられるようになろう"\n---' >                                                              4-error-3-container.md
echo '---\ntitle: "🖥️ ｜ 🐧 ｜ コンテナプロセスのエラーを調べられるようになろう"\n---' >                                                          4-error-4-process.md
echo '---\ntitle: "📚 ｜ 📝 ｜ エラーのまとめ"\n---' >                                                                                            4-error-5-summary.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ ボリュームって？"\n---' >                                                                                          5-volume-1-overview.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ PHP コンテナのファイルをエディタで編集できるようにしよう"\n---' >                                                  5-volume-2-editor.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ MySQL コンテナのデータが残るようにしよう"\n---' >                                                                  5-volume-3-data.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ MySQL コンテナの起動時にテーブルを作成しよう"\n---' >                                                              5-volume-4-table.md
echo '---\ntitle: "📚 ｜ 📝 ｜ ボリュームのまとめ"\n---' >                                                                                        5-volume-5-summary.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ ネットワークって？"\n---' >                                                                                        6-network-1-overview.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ PHP コンテナから MySQL データベースを使おう"\n---' >                                                               6-network-2-mysql.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ PHP コンテナからメールを送信してみよう"\n---' >                                                                    6-network-3-mail.md
echo '---\ntitle: "📚 ｜ 📝 ｜ ネットワークのまとめ"\n---' >                                                                                      6-network-4-summary.md
echo '---\ntitle: "📚 ｜ 🐧 ｜ Makefile って？"\n---' >                                                                                           7-makefile-1-overview.md
echo '---\ntitle: "🖥️ ｜ 🐧 ｜ 長いコマンドを超楽に入力できるようにしよう"\n---' >                                                                7-makefile-2-make.md
echo '---\ntitle: "📚 ｜ 📝 ｜ Makefile のまとめ"\n---' >                                                                                         7-makefile-3-summary.md
echo '---\ntitle: "📚 ｜ 🐳 ｜ Docker Compose って？"\n---' >                                                                                     8-compose-1-overview.md
echo '---\ntitle: "🖥️ ｜ 🐳 ｜ todo replace"\n---' >                                                                                              8-compose-2-replace.md
echo '---\ntitle: "📚 ｜ 📝 ｜ Docker Compose のまとめ"\n---' >                                                                                   8-compose-3-summary.md
echo '---\ntitle: "📚 ｜ ☕ ｜ ホストマシンの言語インストールに応用するには"\n---' >                                                              9-appendix-1-lang.md
echo '---\ntitle: "📚 ｜ ☕ ｜ エディタ設定に応用するには"\n---' >                                                                                9-appendix-2-editor.md
echo '---\ntitle: "📚 ｜ ☕ ｜ 自動テストに応用するには"\n---' >                                                                                  9-appendix-3-test.md
echo '---\ntitle: "📚 ｜ ☕ ｜ デプロイに応用するには"\n---' >                                                                                    9-appendix-4-deploy.md
